experiments/results/fio-rand/9-exfat-fuse-randread-24.txt
/mnt/test_file: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=psync, iodepth=1
...
fio-3.33
Starting 24 processes

/mnt/test_file: (groupid=0, jobs=1): err= 0: pid=215620: Sat Aug 23 13:17:56 2025
  read: IOPS=697, BW=2788KiB/s (2855kB/s)(27.2MiB/10001msec)
    clat (usec): min=747, max=1554, avg=1432.83, stdev=34.16
     lat (usec): min=747, max=1554, avg=1432.87, stdev=34.16
    clat percentiles (usec):
     |  1.00th=[ 1385],  5.00th=[ 1401], 10.00th=[ 1401], 20.00th=[ 1418],
     | 30.00th=[ 1418], 40.00th=[ 1434], 50.00th=[ 1434], 60.00th=[ 1434],
     | 70.00th=[ 1450], 80.00th=[ 1450], 90.00th=[ 1467], 95.00th=[ 1467],
     | 99.00th=[ 1483], 99.50th=[ 1500], 99.90th=[ 1516], 99.95th=[ 1516],
     | 99.99th=[ 1549]
   bw (  KiB/s): min= 2768, max= 2800, per=4.17%, avg=2789.05, stdev= 7.16, samples=19
   iops        : min=  692, max=  700, avg=697.26, stdev= 1.79, samples=19
  lat (usec)   : 750=0.03%, 1000=0.13%
  lat (msec)   : 2=99.84%
  cpu          : usr=0.02%, sys=0.50%, ctx=13936, majf=0, minf=10
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=6971,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
/mnt/test_file: (groupid=0, jobs=1): err= 0: pid=215621: Sat Aug 23 13:17:56 2025
  read: IOPS=696, BW=2785KiB/s (2852kB/s)(27.2MiB/10001msec)
    clat (usec): min=693, max=10671, avg=1435.50, stdev=144.44
     lat (usec): min=693, max=10672, avg=1435.54, stdev=144.44
    clat percentiles (usec):
     |  1.00th=[ 1385],  5.00th=[ 1401], 10.00th=[ 1401], 20.00th=[ 1418],
     | 30.00th=[ 1418], 40.00th=[ 1434], 50.00th=[ 1434], 60.00th=[ 1434],
     | 70.00th=[ 1450], 80.00th=[ 1450], 90.00th=[ 1467], 95.00th=[ 1467],
     | 99.00th=[ 1483], 99.50th=[ 1500], 99.90th=[ 1532], 99.95th=[ 1565],
     | 99.99th=[10683]
   bw (  KiB/s): min= 2744, max= 2800, per=4.17%, avg=2786.11, stdev=12.17, samples=19
   iops        : min=  686, max=  700, avg=696.53, stdev= 3.04, samples=19
  lat (usec)   : 750=0.03%, 1000=0.09%
  lat (msec)   : 2=99.86%, 10=0.01%, 20=0.01%
  cpu          : usr=0.10%, sys=0.44%, ctx=13935, majf=0, minf=9
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=6964,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
/mnt/test_file: (groupid=0, jobs=1): err= 0: pid=215622: Sat Aug 23 13:17:56 2025
  read: IOPS=696, BW=2787KiB/s (2854kB/s)(27.2MiB/10001msec)
    clat (usec): min=732, max=8732, avg=1434.45, stdev=92.14
     lat (usec): min=732, max=8733, avg=1434.49, stdev=92.15
    clat percentiles (usec):
     |  1.00th=[ 1385],  5.00th=[ 1401], 10.00th=[ 1401], 20.00th=[ 1418],
     | 30.00th=[ 1418], 40.00th=[ 1434], 50.00th=[ 1434], 60.00th=[ 1434],
     | 70.00th=[ 1450], 80.00th=[ 1450], 90.00th=[ 1467], 95.00th=[ 1467],
     | 99.00th=[ 1483], 99.50th=[ 1500], 99.90th=[ 1516], 99.95th=[ 1532],
     | 99.99th=[ 8717]
   bw (  KiB/s): min= 2768, max= 2792, per=4.17%, avg=2788.21, stdev= 6.18, samples=19
   iops        : min=  692, max=  698, avg=697.05, stdev= 1.54, samples=19
  lat (usec)   : 750=0.04%, 1000=0.03%
  lat (msec)   : 2=99.91%, 10=0.01%
  cpu          : usr=0.06%, sys=0.68%, ctx=13936, majf=0, minf=10
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=6969,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
/mnt/test_file: (groupid=0, jobs=1): err= 0: pid=215623: Sat Aug 23 13:17:56 2025
  read: IOPS=696, BW=2787KiB/s (2854kB/s)(27.2MiB/10001msec)
    clat (usec): min=692, max=8602, avg=1434.57, stdev=90.24
     lat (usec): min=693, max=8603, avg=1434.62, stdev=90.25
    clat percentiles (usec):
     |  1.00th=[ 1385],  5.00th=[ 1401], 10.00th=[ 1401], 20.00th=[ 1418],
     | 30.00th=[ 1418], 40.00th=[ 1434], 50.00th=[ 1434], 60.00th=[ 1434],
     | 70.00th=[ 1450], 80.00th=[ 1450], 90.00th=[ 1467], 95.00th=[ 1467],
     | 99.00th=[ 1483], 99.50th=[ 1500], 99.90th=[ 1532], 99.95th=[ 1549],
     | 99.99th=[ 8586]
   bw (  KiB/s): min= 2760, max= 2800, per=4.17%, avg=2788.21, stdev= 8.59, samples=19
   iops        : min=  690, max=  700, avg=697.05, stdev= 2.15, samples=19
  lat (usec)   : 750=0.01%, 1000=0.04%
  lat (msec)   : 2=99.93%, 10=0.01%
  cpu          : usr=0.06%, sys=0.68%, ctx=13936, majf=0, minf=10
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=6969,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
/mnt/test_file: (groupid=0, jobs=1): err= 0: pid=215624: Sat Aug 23 13:17:56 2025
  read: IOPS=696, BW=2787KiB/s (2854kB/s)(27.2MiB/10002msec)
    clat (usec): min=763, max=8760, avg=1434.38, stdev=92.64
     lat (usec): min=763, max=8761, avg=1434.43, stdev=92.65
    clat percentiles (usec):
     |  1.00th=[ 1385],  5.00th=[ 1401], 10.00th=[ 1401], 20.00th=[ 1418],
     | 30.00th=[ 1418], 40.00th=[ 1434], 50.00th=[ 1434], 60.00th=[ 1434],
     | 70.00th=[ 1450], 80.00th=[ 1450], 90.00th=[ 1467], 95.00th=[ 1467],
     | 99.00th=[ 1483], 99.50th=[ 1500], 99.90th=[ 1516], 99.95th=[ 1532],
     | 99.99th=[ 8717]
   bw (  KiB/s): min= 2768, max= 2800, per=4.17%, avg=2788.63, stdev= 6.70, samples=19
   iops        : min=  692, max=  700, avg=697.16, stdev= 1.68, samples=19
  lat (usec)   : 1000=0.09%
  lat (msec)   : 2=99.90%, 10=0.01%
  cpu          : usr=0.10%, sys=0.65%, ctx=13937, majf=0, minf=10
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=6970,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
/mnt/test_file: (groupid=0, jobs=1): err= 0: pid=215625: Sat Aug 23 13:17:56 2025
  read: IOPS=696, BW=2787KiB/s (2853kB/s)(27.2MiB/10001msec)
    clat (usec): min=714, max=8631, avg=1434.86, stdev=90.57
     lat (usec): min=714, max=8632, avg=1434.91, stdev=90.58
    clat percentiles (usec):
     |  1.00th=[ 1385],  5.00th=[ 1401], 10.00th=[ 1401], 20.00th=[ 1418],
     | 30.00th=[ 1418], 40.00th=[ 1434], 50.00th=[ 1434], 60.00th=[ 1434],
     | 70.00th=[ 1450], 80.00th=[ 1450], 90.00th=[ 1467], 95.00th=[ 1467],
     | 99.00th=[ 1483], 99.50th=[ 1500], 99.90th=[ 1549], 99.95th=[ 1549],
     | 99.99th=[ 8586]
   bw (  KiB/s): min= 2744, max= 2792, per=4.17%, avg=2787.37, stdev=11.10, samples=19
   iops        : min=  686, max=  698, avg=696.84, stdev= 2.77, samples=19
  lat (usec)   : 750=0.01%, 1000=0.01%
  lat (msec)   : 2=99.94%, 4=0.01%, 10=0.01%
  cpu          : usr=0.08%, sys=0.51%, ctx=13937, majf=0, minf=10
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=6967,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
/mnt/test_file: (groupid=0, jobs=1): err= 0: pid=215626: Sat Aug 23 13:17:56 2025
  read: IOPS=697, BW=2789KiB/s (2855kB/s)(27.2MiB/10001msec)
    clat (usec): min=701, max=1535, avg=1432.58, stdev=36.21
     lat (usec): min=701, max=1535, avg=1432.62, stdev=36.21
    clat percentiles (usec):
     |  1.00th=[ 1385],  5.00th=[ 1401], 10.00th=[ 1401], 20.00th=[ 1418],
     | 30.00th=[ 1418], 40.00th=[ 1434], 50.00th=[ 1434], 60.00th=[ 1434],
     | 70.00th=[ 1450], 80.00th=[ 1450], 90.00th=[ 1467], 95.00th=[ 1467],
     | 99.00th=[ 1483], 99.50th=[ 1500], 99.90th=[ 1516], 99.95th=[ 1516],
     | 99.99th=[ 1532]
   bw (  KiB/s): min= 2768, max= 2800, per=4.17%, avg=2789.47, stdev= 6.56, samples=19
   iops        : min=  692, max=  700, avg=697.37, stdev= 1.64, samples=19
  lat (usec)   : 750=0.03%, 1000=0.16%
  lat (msec)   : 2=99.81%
  cpu          : usr=0.10%, sys=0.46%, ctx=13936, majf=0, minf=8
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=6972,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
/mnt/test_file: (groupid=0, jobs=1): err= 0: pid=215627: Sat Aug 23 13:17:56 2025
  read: IOPS=696, BW=2785KiB/s (2852kB/s)(27.2MiB/10001msec)
    clat (usec): min=1240, max=6214, avg=1434.50, stdev=61.41
     lat (usec): min=1240, max=6214, avg=1434.54, stdev=61.42
    clat percentiles (usec):
     |  1.00th=[ 1385],  5.00th=[ 1401], 10.00th=[ 1401], 20.00th=[ 1418],
     | 30.00th=[ 1418], 40.00th=[ 1434], 50.00th=[ 1434], 60.00th=[ 1434],
     | 70.00th=[ 1450], 80.00th=[ 1450], 90.00th=[ 1467], 95.00th=[ 1467],
     | 99.00th=[ 1483], 99.50th=[ 1500], 99.90th=[ 1516], 99.95th=[ 1516],
     | 99.99th=[ 6194]
   bw (  KiB/s): min= 2712, max= 2800, per=4.16%, avg=2785.68, stdev=18.78, samples=19
   iops        : min=  678, max=  700, avg=696.42, stdev= 4.69, samples=19
  lat (msec)   : 2=99.99%, 10=0.01%
  cpu          : usr=0.10%, sys=0.65%, ctx=13934, majf=0, minf=9
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=6963,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
/mnt/test_file: (groupid=0, jobs=1): err= 0: pid=215628: Sat Aug 23 13:17:56 2025
  read: IOPS=697, BW=2790KiB/s (2857kB/s)(27.2MiB/10001msec)
    clat (usec): min=669, max=1563, avg=1431.92, stdev=42.93
     lat (usec): min=669, max=1563, avg=1431.97, stdev=42.93
    clat percentiles (usec):
     |  1.00th=[ 1385],  5.00th=[ 1401], 10.00th=[ 1401], 20.00th=[ 1418],
     | 30.00th=[ 1418], 40.00th=[ 1434], 50.00th=[ 1434], 60.00th=[ 1434],
     | 70.00th=[ 1450], 80.00th=[ 1450], 90.00th=[ 1467], 95.00th=[ 1467],
     | 99.00th=[ 1483], 99.50th=[ 1500], 99.90th=[ 1516], 99.95th=[ 1516],
     | 99.99th=[ 1565]
   bw (  KiB/s): min= 2776, max= 2840, per=4.17%, avg=2791.16, stdev=13.04, samples=19
   iops        : min=  694, max=  710, avg=697.79, stdev= 3.26, samples=19
  lat (usec)   : 750=0.14%, 1000=0.14%
  lat (msec)   : 2=99.71%
  cpu          : usr=0.17%, sys=0.58%, ctx=13934, majf=0, minf=9
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=6976,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
/mnt/test_file: (groupid=0, jobs=1): err= 0: pid=215629: Sat Aug 23 13:17:56 2025
  read: IOPS=697, BW=2788KiB/s (2855kB/s)(27.2MiB/10001msec)
    clat (usec): min=673, max=5416, avg=1432.93, stdev=62.26
     lat (usec): min=673, max=5416, avg=1432.97, stdev=62.26
    clat percentiles (usec):
     |  1.00th=[ 1385],  5.00th=[ 1401], 10.00th=[ 1401], 20.00th=[ 1418],
     | 30.00th=[ 1418], 40.00th=[ 1434], 50.00th=[ 1434], 60.00th=[ 1434],
     | 70.00th=[ 1450], 80.00th=[ 1450], 90.00th=[ 1467], 95.00th=[ 1467],
     | 99.00th=[ 1483], 99.50th=[ 1500], 99.90th=[ 1516], 99.95th=[ 1532],
     | 99.99th=[ 5407]
   bw (  KiB/s): min= 2720, max= 2840, per=4.17%, avg=2789.05, stdev=20.52, samples=19
   iops        : min=  680, max=  710, avg=697.26, stdev= 5.13, samples=19
  lat (usec)   : 750=0.19%, 1000=0.03%
  lat (msec)   : 2=99.77%, 10=0.01%
  cpu          : usr=0.09%, sys=0.44%, ctx=13934, majf=0, minf=8
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=6971,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
/mnt/test_file: (groupid=0, jobs=1): err= 0: pid=215630: Sat Aug 23 13:17:56 2025
  read: IOPS=696, BW=2788KiB/s (2855kB/s)(27.2MiB/10001msec)
    clat (usec): min=729, max=1564, avg=1433.06, stdev=32.07
     lat (usec): min=729, max=1564, avg=1433.10, stdev=32.07
    clat percentiles (usec):
     |  1.00th=[ 1385],  5.00th=[ 1401], 10.00th=[ 1401], 20.00th=[ 1418],
     | 30.00th=[ 1418], 40.00th=[ 1434], 50.00th=[ 1434], 60.00th=[ 1434],
     | 70.00th=[ 1450], 80.00th=[ 1450], 90.00th=[ 1467], 95.00th=[ 1467],
     | 99.00th=[ 1483], 99.50th=[ 1500], 99.90th=[ 1516], 99.95th=[ 1532],
     | 99.99th=[ 1565]
   bw (  KiB/s): min= 2768, max= 2800, per=4.17%, avg=2788.63, stdev= 7.21, samples=19
   iops        : min=  692, max=  700, avg=697.16, stdev= 1.80, samples=19
  lat (usec)   : 750=0.03%, 1000=0.09%
  lat (msec)   : 2=99.89%
  cpu          : usr=0.20%, sys=0.55%, ctx=13937, majf=0, minf=9
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=6970,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
/mnt/test_file: (groupid=0, jobs=1): err= 0: pid=215631: Sat Aug 23 13:17:56 2025
  read: IOPS=696, BW=2786KiB/s (2853kB/s)(27.2MiB/10001msec)
    clat (usec): min=663, max=8497, avg=1435.09, stdev=106.19
     lat (usec): min=664, max=8497, avg=1435.13, stdev=106.20
    clat percentiles (usec):
     |  1.00th=[ 1385],  5.00th=[ 1401], 10.00th=[ 1401], 20.00th=[ 1418],
     | 30.00th=[ 1418], 40.00th=[ 1434], 50.00th=[ 1434], 60.00th=[ 1434],
     | 70.00th=[ 1450], 80.00th=[ 1450], 90.00th=[ 1467], 95.00th=[ 1467],
     | 99.00th=[ 1483], 99.50th=[ 1500], 99.90th=[ 1532], 99.95th=[ 1549],
     | 99.99th=[ 8455]
   bw (  KiB/s): min= 2736, max= 2800, per=4.17%, avg=2786.95, stdev=13.39, samples=19
   iops        : min=  684, max=  700, avg=696.74, stdev= 3.35, samples=19
  lat (usec)   : 750=0.04%, 1000=0.01%
  lat (msec)   : 2=99.91%, 10=0.03%
  cpu          : usr=0.04%, sys=0.74%, ctx=13934, majf=0, minf=10
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=6966,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
/mnt/test_file: (groupid=0, jobs=1): err= 0: pid=215632: Sat Aug 23 13:17:56 2025
  read: IOPS=696, BW=2787KiB/s (2854kB/s)(27.2MiB/10002msec)
    clat (usec): min=767, max=3780, avg=1433.54, stdev=41.02
     lat (usec): min=767, max=3780, avg=1433.58, stdev=41.02
    clat percentiles (usec):
     |  1.00th=[ 1385],  5.00th=[ 1401], 10.00th=[ 1401], 20.00th=[ 1418],
     | 30.00th=[ 1418], 40.00th=[ 1434], 50.00th=[ 1434], 60.00th=[ 1434],
     | 70.00th=[ 1450], 80.00th=[ 1450], 90.00th=[ 1467], 95.00th=[ 1467],
     | 99.00th=[ 1483], 99.50th=[ 1500], 99.90th=[ 1516], 99.95th=[ 1516],
     | 99.99th=[ 3785]
   bw (  KiB/s): min= 2752, max= 2792, per=4.17%, avg=2787.79, stdev= 9.38, samples=19
   iops        : min=  688, max=  698, avg=696.95, stdev= 2.34, samples=19
  lat (usec)   : 1000=0.10%
  lat (msec)   : 2=99.89%, 4=0.01%
  cpu          : usr=0.12%, sys=0.68%, ctx=13935, majf=0, minf=12
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=6968,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
/mnt/test_file: (groupid=0, jobs=1): err= 0: pid=215633: Sat Aug 23 13:17:56 2025
  read: IOPS=696, BW=2786KiB/s (2853kB/s)(27.2MiB/10002msec)
    clat (usec): min=772, max=1627, avg=1433.72, stdev=24.54
     lat (usec): min=772, max=1627, avg=1433.76, stdev=24.53
    clat percentiles (usec):
     |  1.00th=[ 1385],  5.00th=[ 1401], 10.00th=[ 1401], 20.00th=[ 1418],
     | 30.00th=[ 1418], 40.00th=[ 1434], 50.00th=[ 1434], 60.00th=[ 1434],
     | 70.00th=[ 1450], 80.00th=[ 1450], 90.00th=[ 1467], 95.00th=[ 1467],
     | 99.00th=[ 1483], 99.50th=[ 1500], 99.90th=[ 1516], 99.95th=[ 1532],
     | 99.99th=[ 1631]
   bw (  KiB/s): min= 2736, max= 2800, per=4.17%, avg=2787.37, stdev=13.15, samples=19
   iops        : min=  684, max=  700, avg=696.84, stdev= 3.29, samples=19
  lat (usec)   : 1000=0.03%
  lat (msec)   : 2=99.97%
  cpu          : usr=0.10%, sys=0.66%, ctx=13939, majf=0, minf=8
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=6967,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
/mnt/test_file: (groupid=0, jobs=1): err= 0: pid=215634: Sat Aug 23 13:17:56 2025
  read: IOPS=696, BW=2784KiB/s (2851kB/s)(27.2MiB/10002msec)
    clat (usec): min=805, max=8536, avg=1434.74, stdev=88.31
     lat (usec): min=805, max=8536, avg=1434.79, stdev=88.31
    clat percentiles (usec):
     |  1.00th=[ 1385],  5.00th=[ 1401], 10.00th=[ 1401], 20.00th=[ 1418],
     | 30.00th=[ 1418], 40.00th=[ 1434], 50.00th=[ 1434], 60.00th=[ 1434],
     | 70.00th=[ 1450], 80.00th=[ 1450], 90.00th=[ 1467], 95.00th=[ 1467],
     | 99.00th=[ 1483], 99.50th=[ 1500], 99.90th=[ 1516], 99.95th=[ 1516],
     | 99.99th=[ 8586]
   bw (  KiB/s): min= 2704, max= 2792, per=4.16%, avg=2785.26, stdev=20.00, samples=19
   iops        : min=  676, max=  698, avg=696.32, stdev= 5.00, samples=19
  lat (usec)   : 1000=0.01%
  lat (msec)   : 2=99.97%, 10=0.01%
  cpu          : usr=0.11%, sys=0.68%, ctx=13934, majf=0, minf=9
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=6962,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
/mnt/test_file: (groupid=0, jobs=1): err= 0: pid=215635: Sat Aug 23 13:17:56 2025
  read: IOPS=696, BW=2788KiB/s (2855kB/s)(27.2MiB/10002msec)
    clat (usec): min=650, max=8770, avg=1434.12, stdev=94.54
     lat (usec): min=650, max=8770, avg=1434.16, stdev=94.54
    clat percentiles (usec):
     |  1.00th=[ 1385],  5.00th=[ 1401], 10.00th=[ 1401], 20.00th=[ 1418],
     | 30.00th=[ 1418], 40.00th=[ 1434], 50.00th=[ 1434], 60.00th=[ 1434],
     | 70.00th=[ 1450], 80.00th=[ 1450], 90.00th=[ 1467], 95.00th=[ 1467],
     | 99.00th=[ 1483], 99.50th=[ 1500], 99.90th=[ 1532], 99.95th=[ 1549],
     | 99.99th=[ 8717]
   bw (  KiB/s): min= 2760, max= 2800, per=4.17%, avg=2789.05, stdev= 8.93, samples=19
   iops        : min=  690, max=  700, avg=697.26, stdev= 2.23, samples=19
  lat (usec)   : 750=0.09%, 1000=0.04%
  lat (msec)   : 2=99.84%, 4=0.01%, 10=0.01%
  cpu          : usr=0.00%, sys=0.53%, ctx=13936, majf=0, minf=8
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=6971,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
/mnt/test_file: (groupid=0, jobs=1): err= 0: pid=215636: Sat Aug 23 13:17:56 2025
  read: IOPS=696, BW=2787KiB/s (2853kB/s)(27.2MiB/10001msec)
    clat (usec): min=779, max=1567, avg=1433.60, stdev=25.23
     lat (usec): min=779, max=1567, avg=1433.64, stdev=25.22
    clat percentiles (usec):
     |  1.00th=[ 1385],  5.00th=[ 1401], 10.00th=[ 1401], 20.00th=[ 1418],
     | 30.00th=[ 1418], 40.00th=[ 1434], 50.00th=[ 1434], 60.00th=[ 1434],
     | 70.00th=[ 1450], 80.00th=[ 1450], 90.00th=[ 1467], 95.00th=[ 1467],
     | 99.00th=[ 1483], 99.50th=[ 1500], 99.90th=[ 1516], 99.95th=[ 1532],
     | 99.99th=[ 1565]
   bw (  KiB/s): min= 2744, max= 2792, per=4.17%, avg=2787.37, stdev=11.10, samples=19
   iops        : min=  686, max=  698, avg=696.84, stdev= 2.77, samples=19
  lat (usec)   : 1000=0.03%
  lat (msec)   : 2=99.97%
  cpu          : usr=0.04%, sys=0.75%, ctx=13936, majf=0, minf=9
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=6967,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
/mnt/test_file: (groupid=0, jobs=1): err= 0: pid=215637: Sat Aug 23 13:17:56 2025
  read: IOPS=696, BW=2787KiB/s (2854kB/s)(27.2MiB/10002msec)
    clat (usec): min=655, max=6985, avg=1433.53, stdev=77.39
     lat (usec): min=655, max=6985, avg=1433.58, stdev=77.40
    clat percentiles (usec):
     |  1.00th=[ 1385],  5.00th=[ 1401], 10.00th=[ 1401], 20.00th=[ 1418],
     | 30.00th=[ 1418], 40.00th=[ 1434], 50.00th=[ 1434], 60.00th=[ 1434],
     | 70.00th=[ 1450], 80.00th=[ 1450], 90.00th=[ 1467], 95.00th=[ 1467],
     | 99.00th=[ 1483], 99.50th=[ 1500], 99.90th=[ 1532], 99.95th=[ 1532],
     | 99.99th=[ 6980]
   bw (  KiB/s): min= 2712, max= 2832, per=4.17%, avg=2787.79, stdev=21.06, samples=19
   iops        : min=  678, max=  708, avg=696.95, stdev= 5.26, samples=19
  lat (usec)   : 750=0.13%, 1000=0.06%
  lat (msec)   : 2=99.77%, 4=0.03%, 10=0.01%
  cpu          : usr=0.05%, sys=0.69%, ctx=13935, majf=0, minf=10
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=6968,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
/mnt/test_file: (groupid=0, jobs=1): err= 0: pid=215638: Sat Aug 23 13:17:56 2025
  read: IOPS=696, BW=2785KiB/s (2852kB/s)(27.2MiB/10002msec)
    clat (usec): min=1161, max=4603, avg=1434.37, stdev=45.33
     lat (usec): min=1162, max=4603, avg=1434.42, stdev=45.33
    clat percentiles (usec):
     |  1.00th=[ 1385],  5.00th=[ 1401], 10.00th=[ 1401], 20.00th=[ 1418],
     | 30.00th=[ 1418], 40.00th=[ 1434], 50.00th=[ 1434], 60.00th=[ 1434],
     | 70.00th=[ 1450], 80.00th=[ 1450], 90.00th=[ 1467], 95.00th=[ 1467],
     | 99.00th=[ 1483], 99.50th=[ 1500], 99.90th=[ 1516], 99.95th=[ 1532],
     | 99.99th=[ 4621]
   bw (  KiB/s): min= 2720, max= 2792, per=4.16%, avg=2785.68, stdev=16.35, samples=19
   iops        : min=  680, max=  698, avg=696.42, stdev= 4.09, samples=19
  lat (msec)   : 2=99.97%, 4=0.01%, 10=0.01%
  cpu          : usr=0.06%, sys=0.50%, ctx=13936, majf=0, minf=9
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=6964,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
/mnt/test_file: (groupid=0, jobs=1): err= 0: pid=215639: Sat Aug 23 13:17:56 2025
  read: IOPS=696, BW=2785KiB/s (2851kB/s)(27.2MiB/10001msec)
    clat (usec): min=804, max=6957, avg=1434.59, stdev=70.73
     lat (usec): min=805, max=6957, avg=1434.64, stdev=70.73
    clat percentiles (usec):
     |  1.00th=[ 1385],  5.00th=[ 1401], 10.00th=[ 1401], 20.00th=[ 1418],
     | 30.00th=[ 1418], 40.00th=[ 1434], 50.00th=[ 1434], 60.00th=[ 1434],
     | 70.00th=[ 1450], 80.00th=[ 1450], 90.00th=[ 1467], 95.00th=[ 1467],
     | 99.00th=[ 1483], 99.50th=[ 1500], 99.90th=[ 1516], 99.95th=[ 1532],
     | 99.99th=[ 6980]
   bw (  KiB/s): min= 2712, max= 2792, per=4.16%, avg=2785.26, stdev=18.14, samples=19
   iops        : min=  678, max=  698, avg=696.32, stdev= 4.53, samples=19
  lat (usec)   : 1000=0.01%
  lat (msec)   : 2=99.96%, 4=0.01%, 10=0.01%
  cpu          : usr=0.08%, sys=0.69%, ctx=13933, majf=0, minf=11
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=6962,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
/mnt/test_file: (groupid=0, jobs=1): err= 0: pid=215640: Sat Aug 23 13:17:56 2025
  read: IOPS=696, BW=2787KiB/s (2853kB/s)(27.2MiB/10001msec)
    clat (usec): min=1299, max=8703, avg=1435.00, stdev=89.91
     lat (usec): min=1300, max=8703, avg=1435.04, stdev=89.91
    clat percentiles (usec):
     |  1.00th=[ 1385],  5.00th=[ 1401], 10.00th=[ 1401], 20.00th=[ 1418],
     | 30.00th=[ 1418], 40.00th=[ 1434], 50.00th=[ 1434], 60.00th=[ 1434],
     | 70.00th=[ 1450], 80.00th=[ 1450], 90.00th=[ 1467], 95.00th=[ 1467],
     | 99.00th=[ 1483], 99.50th=[ 1500], 99.90th=[ 1532], 99.95th=[ 1549],
     | 99.99th=[ 8717]
   bw (  KiB/s): min= 2744, max= 2800, per=4.17%, avg=2787.37, stdev=11.41, samples=19
   iops        : min=  686, max=  700, avg=696.84, stdev= 2.85, samples=19
  lat (msec)   : 2=99.99%, 10=0.01%
  cpu          : usr=0.04%, sys=0.68%, ctx=13937, majf=0, minf=9
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=6967,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
/mnt/test_file: (groupid=0, jobs=1): err= 0: pid=215641: Sat Aug 23 13:17:56 2025
  read: IOPS=696, BW=2786KiB/s (2853kB/s)(27.2MiB/10001msec)
    clat (usec): min=1359, max=8701, avg=1435.32, stdev=94.10
     lat (usec): min=1359, max=8702, avg=1435.36, stdev=94.11
    clat percentiles (usec):
     |  1.00th=[ 1385],  5.00th=[ 1401], 10.00th=[ 1401], 20.00th=[ 1418],
     | 30.00th=[ 1418], 40.00th=[ 1434], 50.00th=[ 1434], 60.00th=[ 1434],
     | 70.00th=[ 1450], 80.00th=[ 1450], 90.00th=[ 1467], 95.00th=[ 1467],
     | 99.00th=[ 1483], 99.50th=[ 1500], 99.90th=[ 1516], 99.95th=[ 1549],
     | 99.99th=[ 8717]
   bw (  KiB/s): min= 2736, max= 2792, per=4.17%, avg=2786.53, stdev=12.80, samples=19
   iops        : min=  684, max=  698, avg=696.63, stdev= 3.20, samples=19
  lat (msec)   : 2=99.97%, 4=0.01%, 10=0.01%
  cpu          : usr=0.12%, sys=0.59%, ctx=13937, majf=0, minf=9
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=6965,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
/mnt/test_file: (groupid=0, jobs=1): err= 0: pid=215642: Sat Aug 23 13:17:56 2025
  read: IOPS=695, BW=2783KiB/s (2849kB/s)(27.2MiB/10001msec)
    clat (usec): min=700, max=9496, avg=1435.71, stdev=114.82
     lat (usec): min=701, max=9496, avg=1435.75, stdev=114.83
    clat percentiles (usec):
     |  1.00th=[ 1385],  5.00th=[ 1401], 10.00th=[ 1401], 20.00th=[ 1418],
     | 30.00th=[ 1418], 40.00th=[ 1434], 50.00th=[ 1434], 60.00th=[ 1434],
     | 70.00th=[ 1450], 80.00th=[ 1450], 90.00th=[ 1467], 95.00th=[ 1467],
     | 99.00th=[ 1483], 99.50th=[ 1500], 99.90th=[ 1532], 99.95th=[ 1565],
     | 99.99th=[ 9503]
   bw (  KiB/s): min= 2712, max= 2792, per=4.16%, avg=2783.16, stdev=19.58, samples=19
   iops        : min=  678, max=  698, avg=695.79, stdev= 4.89, samples=19
  lat (usec)   : 750=0.01%
  lat (msec)   : 2=99.94%, 4=0.01%, 10=0.03%
  cpu          : usr=0.11%, sys=0.67%, ctx=13935, majf=0, minf=9
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=6957,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
/mnt/test_file: (groupid=0, jobs=1): err= 0: pid=215643: Sat Aug 23 13:17:56 2025
  read: IOPS=695, BW=2783KiB/s (2850kB/s)(27.2MiB/10001msec)
    clat (usec): min=1357, max=9241, avg=1435.26, stdev=97.49
     lat (usec): min=1357, max=9241, avg=1435.31, stdev=97.50
    clat percentiles (usec):
     |  1.00th=[ 1385],  5.00th=[ 1401], 10.00th=[ 1401], 20.00th=[ 1418],
     | 30.00th=[ 1418], 40.00th=[ 1434], 50.00th=[ 1434], 60.00th=[ 1434],
     | 70.00th=[ 1450], 80.00th=[ 1450], 90.00th=[ 1467], 95.00th=[ 1467],
     | 99.00th=[ 1483], 99.50th=[ 1500], 99.90th=[ 1549], 99.95th=[ 1565],
     | 99.99th=[ 9241]
   bw (  KiB/s): min= 2728, max= 2792, per=4.16%, avg=2784.00, stdev=17.69, samples=19
   iops        : min=  682, max=  698, avg=696.00, stdev= 4.42, samples=19
  lat (msec)   : 2=99.96%, 4=0.03%, 10=0.01%
  cpu          : usr=0.07%, sys=0.65%, ctx=13936, majf=0, minf=7
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=6959,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=65.3MiB/s (68.5MB/s), 2783KiB/s-2790KiB/s (2849kB/s-2857kB/s), io=653MiB (685MB), run=10001-10002msec

Disk stats (read/write):
  nvme0n1: ios=165249/0, merge=0/0, ticks=8323/0, in_queue=8324, util=98.92%